In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv("praktikum_datasets/world_population.csv",usecols=['country','pop2021','area'],index_col='country')

In [4]:
df

                   pop2021     area
country
Macau              658.394       30
Monaco              39.511        2
Singapore         5896.686      710
Hong Kong         7552.810     1104
Gibraltar           33.698        6
...                    ...      ...
Namibia           2587.344   825615
Western Sahara     611.875   266000
Mongolia          3329.289  1564110
Falkland Islands     3.533    12173
Greenland           56.877  2166086

[232 rows x 2 columns]

In [5]:
df.loc['Uzbekistan']

pop2021     33935.763
area       447400.000
Name: Uzbekistan, dtype: float64

In [6]:
df.loc['India']

pop2021    1393409.038
area       3287590.000
Name: India, dtype: float64

In [7]:
bins =[0,1000,10000,30000,50000,100000,300000,1500000]

In [8]:
population = df.pop2021

In [9]:
population

country
Macau                658.394
Monaco                39.511
Singapore           5896.686
Hong Kong           7552.810
Gibraltar             33.698
                      ...
Namibia             2587.344
Western Sahara       611.875
Mongolia            3329.289
Falkland Islands       3.533
Greenland             56.877
Name: pop2021, Length: 232, dtype: float64

In [10]:
group = pd.cut(population,bins) # filtering to group

In [11]:
group

country
Macau                   (0, 1000]
Monaco                  (0, 1000]
Singapore           (1000, 10000]
Hong Kong           (1000, 10000]
Gibraltar               (0, 1000]
                        ...
Namibia             (1000, 10000]
Western Sahara          (0, 1000]
Mongolia            (1000, 10000]
Falkland Islands        (0, 1000]
Greenland               (0, 1000]
Name: pop2021, Length: 232, dtype: category
Categories (7, interval[int64, right]): [(0, 1000] < (1000, 10000] < (10000, 30000] < (30000, 50000] < (50000, 100000] < (100000, 300000] < (300000, 1500000]]

In [12]:
group.value_counts() # count values quantity

(0, 1000]            72
(1000, 10000]        68
(10000, 30000]       44
(30000, 50000]       19
(50000, 100000]      15
(100000, 300000]     11
(300000, 1500000]     3
Name: pop2021, dtype: int64

In [13]:
df['group'] = group # adding to group

In [14]:
df

                   pop2021     area          group
country
Macau              658.394       30      (0, 1000]
Monaco              39.511        2      (0, 1000]
Singapore         5896.686      710  (1000, 10000]
Hong Kong         7552.810     1104  (1000, 10000]
Gibraltar           33.698        6      (0, 1000]
...                    ...      ...            ...
Namibia           2587.344   825615  (1000, 10000]
Western Sahara     611.875   266000      (0, 1000]
Mongolia          3329.289  1564110  (1000, 10000]
Falkland Islands     3.533    12173      (0, 1000]
Greenland           56.877  2166086      (0, 1000]

[232 rows x 3 columns]

# price qcut

In [15]:
df = pd.read_csv("praktikum_datasets/automobile_data.csv",index_col =0)

In [16]:
df.head()

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
index,,,,,,,,,
0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0

In [17]:
df.price.describe()

count       58.000000
mean     15387.000000
std      11320.259841
min       5151.000000
25%       6808.500000
50%      11095.000000
75%      18120.500000
max      45400.000000
Name: price, dtype: float64

In [19]:
bins=[0,10000,20000,50000]

In [23]:
range = pd.cut(df.price,bins)

In [24]:
range.value_counts()

(0, 10000]        28
(10000, 20000]    17
(20000, 50000]    13
Name: price, dtype: int64

In [25]:
names = ["arzon","o'rta","qimmat"]
range = pd.cut(df.price,bins,labels=names) # naming labels

In [26]:
range.value_counts()

arzon     28
o'rta     17
qimmat    13
Name: price, dtype: int64

In [28]:
# without giving categorizing
range = pd.cut(df.price,5)
range.value_counts()

(5110.751, 13200.8]    32
(13200.8, 21250.6]     14
(29300.4, 37350.2]      7
(37350.2, 45400.0]      3
(21250.6, 29300.4]      2
Name: price, dtype: int64

# qcut()

In [29]:
range = pd.qcut(df.horsepower,3) # equal category

In [33]:
range.value_counts()

(47.999, 70.0]    24
(111.0, 288.0]    20
(70.0, 111.0]     17
Name: horsepower, dtype: int64

In [34]:
range = pd.qcut(df.price,3)

In [35]:
range.value_counts()

(5150.999, 7295.0]    20
(7295.0, 16430.0]     19
(16430.0, 45400.0]    19
Name: price, dtype: int64